tap "armmbed/formulae"
tap "aws/tap"
tap "cloudflare/cloudflare"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "messense/macos-cross-toolchains"
tap "romkatv/powerlevel10k"
tap "sergiobenitez/osxct"
tap "sidneys/homebrew"
tap "soracom/soracom-cli"
tap "tnishinaga/sigrok"
brew "python@3.12"
brew "ansible"
brew "anyenv"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "arduino-cli"
brew "aria2"
brew "asciinema"
brew "asio"
brew "assimp"
brew "aws-sam-cli"
brew "bat"
brew "binutils"
brew "bison"
brew "boost"
brew "bullet"
brew "cabextract"
brew "freetype"
brew "glib"
brew "ocaml"
brew "camlp5"
brew "llvm"
brew "ccls"
brew "cdrtools"
brew "eigen"
brew "gcc"
brew "cfn-lint"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "console_bridge"
brew "cookiecutter"
brew "coq"
brew "coreutils"
brew "pcre"
brew "cppcheck"
brew "cunit"
brew "deno"
brew "direnv"
brew "ebook-tools"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "libgit2"
brew "exa"
brew "harfbuzz"
brew "pango"
brew "node"
brew "firebase-cli"
brew "fzy"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git-lfs"
brew "glfw"
brew "glibmm@2.66"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "hexyl"
brew "http-server"
brew "hugo"
brew "icarus-verilog"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "iproute2mac"
brew "jq"
brew "lazygit"
brew "ledit"
brew "lf"
brew "libfido2"
brew "numpy"
brew "py3cairo"
brew "pygobject3"
brew "libsigrok"
brew "python@3.10"
brew "libsigrokdecode", args: ["HEAD"]
brew "lua-language-server"
brew "make"
brew "marp-cli"
brew "multitime"
brew "mysql-client"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "opam"
brew "openjdk"
brew "pandoc"
brew "peco"
brew "picocom"
brew "platformio"
brew "popt"
brew "postgresql@14"
brew "powerlevel10k"
brew "procs"
brew "protobuf"
brew "pyenv"
brew "pygments"
brew "qt"
brew "pyqt"
brew "python@3.11"
brew "python@3.8"
brew "qemu"
brew "qt@5"
brew "r"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust-analyzer"
brew "sdcc"
brew "sigrok-cli"
brew "starship"
brew "task"
brew "taskwarrior-tui"
brew "terraform-lsp"
brew "tmux"
brew "tree"
brew "u-boot-tools"
brew "uvicorn"
brew "wget"
brew "wimlib"
brew "winetricks"
brew "xorriso"
brew "yq"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "cloudflare/cloudflare/cloudflared"
brew "hashicorp/tap/terraform"
brew "soracom/soracom-cli/soracom-cli"
brew "tnishinaga/sigrok/sigrok-firmware-fx2lafw", link: false
cask "alacritty"
cask "alfred"
cask "anaconda"
cask "appcleaner"
cask "arduino"
cask "arduino-ide"
cask "calibre"
cask "coolterm"
cask "cyberduck"
cask "discord"
cask "docker"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-eb-garamond"
cask "font-hack-nerd-font"
cask "gdisk"
cask "gimp"
cask "gitup"
cask "gnucash"
cask "google-chrome"
cask "gtkwave"
cask "handbrake"
cask "hyper"
cask "inkscape"
cask "keybase"
cask "keyboard-cleaner"
cask "krita"
cask "macfuse"
cask "mactex-no-gui"
cask "mattermost"
cask "microsoft-teams"
cask "mochi-diffusion"
cask "nextcloud"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "onedrive"
cask "onyx"
cask "openscad"
cask "postico"
cask "postman"
cask "prince"
cask "processing"
cask "raspberry-pi-imager"
cask "readdle-spark"
cask "resilio-sync"
cask "scilab"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "spotify"
cask "stoplight-studio"
cask "temurin8"
cask "utm"
cask "vimr"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wineskin"
cask "wireshark"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "amapleaf.linker-script"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "atlassian.atlascode"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "chrisnevers.rusty"
vscode "clarkyu.vscode-sql-beautify"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-yaml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "espresso3389.unicode-normalizer"
vscode "fabianlauer.vs-code-xml-format"
vscode "fabiospampinato.vscode-diff"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "funkyremi.vscode-google-translate"
vscode "gamunu.vscode-yarn"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "joaompinto.vscode-graphviz"
vscode "jock.svg"
vscode "josetr.cmake-language-support-vscode"
vscode "jtr.vscode-position"
vscode "lihui.vs-color-picker"
vscode "luke-zhang-04.processing-vscode"
vscode "marp-team.marp-vscode"
vscode "marus25.cortex-debug"
vscode "matangover.mypy"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mechatroner.rainbow-csv"
vscode "moozzyk.arduino"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.mssql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "ocamllabs.ocaml-platform"
vscode "octref.vetur"
vscode "panicbit.cargo"
vscode "patricklee.vsnotes"
vscode "pdconsec.vscode-print"
vscode "platformio.platformio-ide"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ruoz.coq"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "statiolake.vscode-rustfmt"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "taichi.vscode-textlint"
vscode "tamasfe.even-better-toml"
vscode "tobiah.language-pde"
vscode "tomoki1207.pdf"
vscode "torn4dom4n.latex-support"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "vuetifyjs.vuetify-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xqchen.yarn-ui"
vscode "yzane.markdown-pdf"
vscode "zignd.html-css-class-completion"
vscode "zixuanwang.linkerscript"
