tap "armmbed/formulae"
tap "aws/tap"
tap "cartr/qt4"
tap "cloudflare/cloudflare"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "mac-cleanup/mac-cleanup-py"
tap "messense/macos-cross-toolchains"
tap "osx-cross/avr"
tap "rioriost/parasync"
tap "sergiobenitez/osxct"
tap "tnishinaga/sigrok"
tap "tomoyanonymous/flatcam"
brew "agg"
brew "freetype"
brew "gcc"
brew "sqlite"
brew "python@3.12"
brew "aider"
brew "little-cms2"
brew "jpeg-xl"
brew "webp"
brew "aom"
brew "protobuf"
brew "arduino-cli"
brew "aria2"
brew "asciinema"
brew "assimp"
brew "boost"
brew "avrdude"
brew "binutils"
brew "glib"
brew "ccls"
brew "cfn-lint"
brew "eigen"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "console_bridge"
brew "cookiecutter"
brew "coreutils"
brew "cppcheck"
brew "direnv"
brew "ebook-tools"
brew "popt"
brew "ffmpeg"
brew "fzy"
brew "libavif"
brew "gd"
brew "unbound"
brew "gnutls"
brew "shared-mime-info"
brew "libheif"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdk-pixbuf"
brew "gemini-cli"
brew "gh"
brew "harfbuzz"
brew "pango"
brew "ghostscript"
brew "git-lfs"
brew "glibmm@2.66"
brew "gobject-introspection"
brew "guile"
brew "gum"
brew "hadolint"
brew "http-server"
brew "huggingface-cli"
brew "icarus-verilog"
brew "imagemagick"
brew "iperf3"
brew "iproute2mac"
brew "openjdk"
brew "kotlin"
brew "lazygit"
brew "lf"
brew "libfido2"
brew "libgit2"
brew "librsvg"
brew "py3cairo"
brew "pygobject3"
brew "libsigrok"
brew "libslirp"
brew "lpc21isp"
brew "lua-language-server"
brew "mcp-inspector"
brew "mlx-c"
brew "multitime"
brew "mysql-client"
brew "neovim"
brew "netpbm"
brew "nikto"
brew "nmap"
brew "nodenv"
brew "ocaml"
brew "ollama", restart_service: :changed
brew "pmix"
brew "open-mpi"
brew "open-ocd"
brew "ripgrep"
brew "opencode"
brew "pandoc"
brew "pcre"
brew "platformio"
brew "pygments"
brew "python-lsp-server"
brew "python@3.10"
brew "qemu"
brew "reattach-to-user-namespace"
brew "starship"
brew "task"
brew "taskwarrior-tui"
brew "tcl-tk"
brew "telnet"
brew "tmux"
brew "tree"
brew "typst"
brew "u-boot-tools"
brew "uvicorn"
brew "wget"
brew "xorriso"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
brew "osx-cross/avr/avr-gcc@9"
brew "tnishinaga/sigrok/sigrok-firmware-fx2lafw"
brew "tomoyanonymous/flatcam/flatcam-evo"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "arduino-ide"
cask "blackhole-2ch"
cask "cinder"
cask "claude-code"
cask "cncjs"
cask "cyberduck"
cask "discord"
cask "drawio"
cask "firefox"
cask "font-eb-garamond"
cask "font-hack-nerd-font"
cask "freecad"
cask "google-chrome"
cask "keybase"
cask "keyboard-cleaner"
cask "keycastr"
cask "kicad"
cask "krita"
cask "mactex-no-gui"
cask "microsoft-teams"
cask "mochi-diffusion"
cask "obs"
cask "obsidian"
cask "onyx"
cask "openscad"
cask "postico"
cask "prince"
cask "processing"
cask "raspberry-pi-imager"
cask "slack"
cask "stoplight-studio"
cask "temurin@8"
cask "visual-studio-code"
cask "vlc"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "charliermarsh.ruff"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
cargo "cargo-audit"
cargo "cargo-compete"
cargo "cargo-generate"
cargo "diesel_cli"
cargo "func-cli"
cargo "mdbook"
cargo "nil"
cargo "ravedude"
cargo "rerun-cli"
cargo "rustlings"
uv "pip-audit"
